karmanBreakdown/system/blockMeshDict
FoamFile
{
    version 2.0;
    format  ascii;
    class   dictionary;
    object  blockMeshDict;
}

convertToMeters 1;

r 0.5;
x0 #eval "5 - 0.5 * $r * sqrt(2)";
x1 #eval "5 + 0.5 * $r * sqrt(2)";

vertices
(
    (0    0    0  ) // 0
    (2.5  0    0  ) // 1
    (7.5  0    0  ) // 2
    (80   0    0  ) // 3
    (0    0    0.1) // 4
    (2.5  0    0.1) // 5
    (7.5  0    0.1) // 6
    (80   0    0.1) // 7
    (0    2.5  0  ) // 8
    (2.5  2.5  0  ) // 9
    (7.5  2.5  0  ) // 10
    (80   2.5  0  ) // 11 
    (0    2.5  0.1) // 12
    (2.5  2.5  0.1) // 13
    (7.5  2.5  0.1) // 14
    (80   2.5  0.1) // 15
    (0    7.5  0  ) // 16
    (2.5  7.5  0  ) // 17
    (7.5  7.5  0  ) // 18
    (80   7.5  0  ) // 19
    (0    7.5  0.1) // 20
    (2.5  7.5  0.1) // 21
    (7.5  7.5  0.1) // 22
    (80   7.5  0.1) // 23
    (0    10   0  ) // 24
    (2.5  10   0  ) // 25
    (7.5  10   0  ) // 26
    (80   10   0  ) // 27
    (0    10   0.1) // 28
    (2.5  10   0.1) // 29
    (7.5  10   0.1) // 30
    (80   10   0.1) // 31
    ($x0  $x0  0  ) // 32
    ($x1  $x0  0  ) // 33
    ($x0  $x0  0.1) // 34
    ($x1  $x0  0.1) // 35
    ($x0  $x1  0  ) // 36
    ($x1  $x1  0  ) // 37
    ($x0  $x1  0.1) // 38
    ($x1  $x1  0.1) // 39
);

edges
(
    arc 32 36 (4.5  5    0  )
    arc 34 38 (4.5  5    0.1)
    arc 36 37 (5    5.5  0  )
    arc 38 39 (5    5.5  0.1)
    arc 33 37 (5.5  5    0  )
    arc 35 39 (5.5  5    0.1)
    arc 32 33 (5    4.5  0  )
    arc 34 35 (5    4.5  0.1)
);

blocks
(
    hex (0  1  9  8  4  5  13 12) (50  30  1) simpleGrading (1 0.5 1)
    hex (1  2  10 9  5  6  14 13) (100 30  1) simpleGrading (1 0.5 1)
    hex (2  3  11 10 6  7  15 14) (550 30  1) simpleGrading (5 0.5 1)
    hex (8  9  17 16 12 13 21 20) (50  100 1) simpleGrading (1 1   1)
    hex (10 11 19 18 14 15 23 22) (550 100 1) simpleGrading (5 1   1)
    hex (16 17 25 24 20 21 29 28) (50  30  1) simpleGrading (1 2   1)
    hex (17 18 26 25 21 22 30 29) (100 30  1) simpleGrading (1 2   1)
    hex (18 19 27 26 22 23 31 30) (550 30  1) simpleGrading (5 2   1)

    hex (9  32 36 17 13 34 38 21) (60  100 1) simpleGrading (0.2 1   1)
    hex (36 37 18 17 38 39 22 21) (100 60  1) simpleGrading (1   5   1)
    hex (33 10 18 37 35 14 22 39) (60  100 1) simpleGrading (5   1   1)
    hex (9  10 33 32 13 14 35 34) (100 60  1) simpleGrading (1   0.2 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0  8  12 4 )
            (8  16 20 12)
            (16 24 28 20)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7  15 11 3 )
            (15 23 19 11)
            (23 31 27 19)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (1  0  4  5 )
            (2  1  5  6 )
            (3  2  6  7 )
        );
    }
    top
    {
        type wall;
        faces
        (
            (24 25 29 28)
            (25 26 30 29)
            (26 27 31 30)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (1  9  8  0 )
            (2  10 9  1 )
            (3  11 10 2 )
            (9  17 16 8 )
            (11 19 18 10)
            (17 25 24 16)
            (18 26 25 17)
            (19 27 26 18)
            (4  12 13 5 )
            (5  13 14 6 )
            (6  14 15 7 )
            (12 20 21 13)
            (14 22 23 15)
            (20 28 29 21)
            (21 29 30 22)
            (22 30 31 23)
            (9  32 36 17)
            (36 37 18 17)
            (33 10 18 37)
            (9  10 33 32)
            (13 21 38 34)
            (38 21 22 39)
            (35 39 22 14)
            (13 34 35 14)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (34 38 36 32)
            (38 39 37 36)
            (33 37 39 35)
            (32 33 35 34)
        );
    }
);